#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deep-thought/iac-github/runs/run-3P4MFpEr7Pt3TF4f

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
github_repository.hans-m-song_kube-stack: Refreshing state... [id=kube-stack]
github_repository.hans-m-song_huisheng: Refreshing state... [id=huisheng]
github_repository.hans-m-song_iac: Refreshing state... [id=iac]
github_actions_repository_oidc_subject_claim_customization_template.hans-m-song_iac: Refreshing state... [id=iac]
github_repository_webhook.actions_runner_controller_hans-m-song-iac: Refreshing state... [id=398768556]
github_actions_secret.hans-m-song_iac_aws_deploy_role_arn: Refreshing state... [id=iac:aws_deploy_role_arn]
github_repository.songmatrix_sync-service: Refreshing state... [id=sync-service]
github_repository.songmatrix_frontend-web: Refreshing state... [id=frontend-web]
github_repository.songmatrix_github: Refreshing state... [id=.github]
github_repository.songmatrix_data-service: Refreshing state... [id=data-service]
github_organization_webhook.actions_runner_controller_songmatrix: Refreshing state... [id=397146225]
github_repository.songmatrix_gateway: Refreshing state... [id=gateway]
github_repository.axatol_home-assistant-integrations: Refreshing state... [id=home-assistant-integrations]
github_organization_webhook.actions_runner_controller_axatol: Refreshing state... [id=397146175]
github_repository.axatol_actions: Refreshing state... [id=actions]
github_repository_webhook.actions_runner_controller_hans-m-song-huisheng: Refreshing state... [id=397854046]
github_repository_webhook.actions_runner_controller_hans-m-song-kube-stack: Refreshing state... [id=397146056]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_repository_oidc_subject_claim_customization_template.hans-m-song_iac will be updated in-place
  ~ resource "github_actions_repository_oidc_subject_claim_customization_template" "hans-m-song_iac" {
        id                 = "iac"
      ~ include_claim_keys = [
          + "job_workflow_ref",
          + "event_name",
          + "actor",
          + "environment",
        ]
      ~ use_default        = true -> false
        # (1 unchanged attribute hidden)
    }

  # github_repository.axatol_yt-dlp-ui will be created
  + resource "github_repository" "axatol_yt-dlp-ui" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Youtube downloader server and frontend"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "yt-dlp-ui"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @hans-m-song, Action: `pull_request`, Working Directory: `github`, Workflow: `Terraform Github`*